# Vertex Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Vertex Class
Members See Also
---
The base class for DirectContext3D vertices.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class Vertex : IDisposable
```

Visual Basic
---
```text
Public Class Vertex _
	Implements IDisposable
```

Visual C++
---
```text
public ref class Vertex : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..Vertex Autodesk.Revit.DB.DirectContext3D..::..VertexPosition Autodesk.Revit.DB.DirectContext3D..::..VertexPositionColored Autodesk.Revit.DB.DirectContext3D..::..VertexPositionNormal Autodesk.Revit.DB.DirectContext3D..::..VertexPositionNormalColored
# See Also
Vertex Members
Autodesk.Revit.DB.DirectContext3D Namespace